renesas/amazon-freertos/demos/renesas/rx65n-rsk/e2studio/ccrx/boot_loader/src/boot_loader.c
    /* startup system */
    printf("-------------------------------------------------\r\n");
    printf("RX65N secure boot program\r\n");
    printf("-------------------------------------------------\r\n");

    result_secure_boot = secure_boot();
    if (BOOT_LOADER_SUCCESS == result_secure_boot)
    {
    	/* stop all interrupt completely */
        set_psw(0);

    	uint32_t addr;
    	addr = *(uint32_t*)USER_RESET_VECTOR_ADDRESS;
    	((void (*)())addr)();
    	while(1); /* infinite loop */
    }
    else if (BOOT_LOADER_GOTO_INSTALL == result_secure_boot)
    {
        /* Set up the USB */
        ctrl.module     = USB_IP0;
        ctrl.type       = USB_HMSC;
        cfg.usb_speed   = USB_FS;
        cfg.usb_mode    = USB_HOST;
        R_USB_Open(&ctrl, &cfg);


        printf("========== install user program phase ==========\r\n");
        printf("insert USB memory includes \"%s\"\r\n", INITIAL_FIRMWARE_FILE_NAME);
        while(1)
        {
            event = R_USB_GetEvent(&ctrl);
            if(event != previous_event)
            {
                if(event == USB_STS_CONFIGURED)
                {
                    R_tfat_f_mount(0, &g_fatfs);
                    printf("usb memory attached.\r\n");
                    if(TFAT_FR_OK == R_tfat_f_stat(INITIAL_FIRMWARE_FILE_NAME, &filinfo))
                    {
                        printf("Detected file. %s.\r\n", INITIAL_FIRMWARE_FILE_NAME);

                        printf("erase install area (data flash): ");
                        flash_error_code = R_FLASH_Erase((flash_block_address_t)BOOT_LOADER_USER_CONST_DATA_LOW_ADDRESS, BOOT_LOADER_UPDATE_CONST_DATA_TARGET_BLOCK_NUMBER);
                        if (FLASH_SUCCESS == flash_error_code)
                        {
                            printf("OK\r\n");
                        }
                        else
                        {
                            printf("R_FLASH_Erase() returns error. %d.\r\n", flash_error_code);
                            printf("system error.\r\n");
                            while(1);
                        }

                        printf("erase install area (code flash): ");
                        flash_error_code = R_FLASH_Erase((flash_block_address_t)BOOT_LOADER_UPDATE_TEMPORARY_AREA_HIGH_ADDRESS, FLASH_NUM_BLOCKS_CF - BOOT_LOADER_MIRROR_BLOCK_NUM_FOR_SMALL - BOOT_LOADER_MIRROR_BLOCK_NUM_FOR_MEDIUM);
                        if (FLASH_SUCCESS == flash_error_code)
                        {
                            printf("OK\r\n");
                        }
                        else
                        {
                            printf("R_FLASH_Erase() returns error. %d.\r\n", flash_error_code);
                            printf("system error.\r\n");
                            while(1);
                        }

                        /* install code flash area */
                        while(1)
                        {
                            if(!firm_block_read(load_firmware_control_block.flash_buffer, load_firmware_control_block.offset))
                            {
                                R_FLASH_Write((uint32_t)load_firmware_control_block.flash_buffer, (uint32_t)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS + load_firmware_control_block.offset, sizeof(load_firmware_control_block.flash_buffer));
                                load_firmware_control_block.offset += FLASH_CF_MEDIUM_BLOCK_SIZE;
                                load_firmware_control_block.progress = (uint32_t)(((float)(load_firmware_control_block.offset)/(float)((FLASH_CF_MEDIUM_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER))*100));
                                printf("installing firmware...%d%(%d/%dKB).\r", load_firmware_control_block.progress, load_firmware_control_block.offset/1024, (FLASH_CF_MEDIUM_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER)/1024);
                                if(load_firmware_control_block.offset < (FLASH_CF_MEDIUM_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER))
                                {
                                    /* one more loop */
                                }
                                else if(load_firmware_control_block.offset == (FLASH_CF_MEDIUM_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER))
                                {
                                    printf("\n");
                                    printf("completed installing firmware.\r\n");
                                    break;
                                }
                                else
                                {
                                    printf("\n");
                                    printf("fatal error occurred.\r\n");
                                    break;
                                }
                            }
                            else
                            {
                                printf("\n");
                                printf("filesystem output error.\r\n");
                                break;
                            }
                        }
                        printf("code flash hash check...");
                        R_Sha1((uint8_t*)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS + BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH,
                        		hash_sha1, (FLASH_CF_MEDIUM_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER) - BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH);
                        if(0 == memcmp(hash_sha1, firmware_update_control_block_bank1->signature, SHA1_HASH_LENGTH_BYTE_SIZE))
                        {
                            printf("OK\r\n");
                        }
                        else
                        {
                            printf("NG\r\n");
                            while(1);
                        }

                        /* install data flash area */
                        while(1)
                        {
                            if(!const_data_block_read(load_const_data_control_block.flash_buffer, load_const_data_control_block.offset))
                            {
                            	flash_error_code = R_FLASH_Write((uint32_t)load_const_data_control_block.flash_buffer, (uint32_t)BOOT_LOADER_USER_CONST_DATA_LOW_ADDRESS + load_const_data_control_block.offset, sizeof(load_const_data_control_block.flash_buffer));
                                if (FLASH_SUCCESS != flash_error_code)
                                {
                                    printf("R_FLASH_Write() returns error. %d.\r\n", flash_error_code);
                                    printf("system error.\r\n");
                                    while(1);
                                }
                                load_const_data_control_block.offset += FLASH_DF_BLOCK_SIZE;
                                load_const_data_control_block.progress = (uint32_t)(((float)(load_const_data_control_block.offset)/(float)((FLASH_DF_BLOCK_SIZE * BOOT_LOADER_UPDATE_CONST_DATA_TARGET_BLOCK_NUMBER))*100));
                                static uint32_t previous_offset = 0;
                                if(previous_offset != (load_const_data_control_block.offset/1024))
                                {
                                    printf("installing const data...%d%(%d/%dKB).\r", load_const_data_control_block.progress, load_const_data_control_block.offset/1024, (FLASH_DF_BLOCK_SIZE * BOOT_LOADER_UPDATE_CONST_DATA_TARGET_BLOCK_NUMBER)/1024);
                                    previous_offset = load_const_data_control_block.offset/1024;
                                }
                                if(load_const_data_control_block.offset < (FLASH_DF_BLOCK_SIZE * BOOT_LOADER_UPDATE_CONST_DATA_TARGET_BLOCK_NUMBER))
                                {
                                    /* one more loop */
                                }
                                else if(load_const_data_control_block.offset == (FLASH_DF_BLOCK_SIZE * BOOT_LOADER_UPDATE_CONST_DATA_TARGET_BLOCK_NUMBER))
                                {
                                    printf("\n");
                                    printf("completed installing const data.\r\n");
                                    printf("software reset...\r\n");
                                    R_BSP_SoftwareDelay(3000, BSP_DELAY_MILLISECS);
                                    R_USB_Close(&ctrl);
                                    software_reset();
                                }
                                else
                                {
                                    printf("\n");
                                    printf("fatal error occurred.\r\n");
                                    while(1);
                                }
                            }
                            else
                            {
                                printf("\n");
                                printf("filesystem output error.\r\n");
                                while(1);
                            }
                        }
                    }
                    else
                    {
                        printf("File Not Found. %s.\r\n", INITIAL_FIRMWARE_FILE_NAME);
                    }
                }
                else if(event == USB_STS_DETACH)
                {
                    printf("usb memory detached.\r\n");
                }
            }
            previous_event = event;
        }
    }
    else if (BOOT_LOADER_FAIL == result_secure_boot)
    {
        printf("secure boot sequence:");
        printf("fail.");
        while(1)
        {
            /* infinity loop */
        }
    }
    else
    {
        printf("unknown status.\n");
        while(1)
        {
            /* infinite loop */
        }
    }
}

static int32_t secure_boot(void)
{
    flash_err_t flash_error_code = FLASH_SUCCESS;
    int32_t secure_boot_error_code = BOOT_LOADER_FAIL;
    uint8_t hash_sha1[SHA1_HASH_LENGTH_BYTE_SIZE];
    uint32_t bank_info = 255;

    printf("Checking flash ROM status.\r\n");

    printf("bank 0 status = 0x%x [%s]\r\n", firmware_update_control_block_bank0->image_flag, get_status_string(firmware_update_control_block_bank0->image_flag));
    printf("bank 1 status = 0x%x [%s]\r\n", firmware_update_control_block_bank1->image_flag, get_status_string(firmware_update_control_block_bank1->image_flag));

    R_FLASH_Control(FLASH_CMD_BANK_GET, &bank_info);
    printf("bank info = %d. (start bank = %d)\r\n", bank_info, (bank_info ^ 0x01));

    switch(firmware_update_control_block_bank0->image_flag)
    {
        case LIFECYCLE_STATE_BLANK:
        	if(firmware_update_control_block_bank1->image_flag != LIFECYCLE_STATE_TESTING)
        	{
				printf("start installing user program.\r\n");
				printf("erase bank1 secure boot mirror area...");
				flash_error_code = R_FLASH_Erase(BOOT_LOADER_MIRROR_HIGH_ADDRESS, BOOT_LOADER_MIRROR_BLOCK_NUM_FOR_SMALL + BOOT_LOADER_MIRROR_BLOCK_NUM_FOR_MEDIUM);
				if(FLASH_SUCCESS == flash_error_code)
				{
					printf("OK\r\n");
				}
				else
				{
					printf("NG\r\n");
					printf("R_FLASH_Erase() returns error code = %d.\r\n", flash_error_code);
					secure_boot_error_code = BOOT_LOADER_FAIL;
					break;
				}

				printf("copy secure boot from bank0 to bank1...");
				if(BOOT_LOADER_MIRROR_BLOCK_NUM_FOR_MEDIUM > 0)
				{
					flash_error_code = R_FLASH_Write((uint32_t)FLASH_CF_BLOCK_7, (uint32_t)FLASH_CF_BLOCK_45, 8 * FLASH_CF_SMALL_BLOCK_SIZE);
					flash_error_code = R_FLASH_Write((uint32_t)BOOT_LOADER_LOW_ADDRESS, (uint32_t)BOOT_LOADER_MIRROR_LOW_ADDRESS, ((uint32_t)BOOT_LOADER_MIRROR_BLOCK_NUM_FOR_MEDIUM) * FLASH_CF_MEDIUM_BLOCK_SIZE);
				}
				else
				{
					flash_error_code = R_FLASH_Write((uint32_t)BOOT_LOADER_LOW_ADDRESS, (uint32_t)BOOT_LOADER_MIRROR_LOW_ADDRESS, (uint32_t)BOOT_LOADER_MIRROR_BLOCK_NUM_FOR_SMALL * FLASH_CF_SMALL_BLOCK_SIZE);

