renesas/amazon-freertos/demos/renesas/rx65n-rsk/e2studio/ccrx/boot_loader/src/boot_loader.c
				}
				if(FLASH_SUCCESS == flash_error_code)
				{
					printf("OK\r\n");
				}
				else
				{
					printf("NG\r\n");
					printf("R_FLASH_Write() returns error code = %d.\r\n", flash_error_code);
					secure_boot_error_code = BOOT_LOADER_FAIL;
					break;
				}
				secure_boot_error_code = BOOT_LOADER_GOTO_INSTALL;
        	}
        	else
        	{
            	memcpy(load_firmware_control_block.flash_buffer, (void*)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS, FLASH_CF_MEDIUM_BLOCK_SIZE);
            	FIRMWARE_UPDATE_CONTROL_BLOCK *firmware_update_control_block_tmp = (FIRMWARE_UPDATE_CONTROL_BLOCK*)load_firmware_control_block.flash_buffer;
                printf("verifying update data: ");
                R_Sha1((uint8_t*)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS + BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH,
                		hash_sha1, (FLASH_CF_MEDIUM_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER) - BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH);
                if(0 == memcmp(hash_sha1, firmware_update_control_block_bank1->signature, SHA1_HASH_LENGTH_BYTE_SIZE))
                {
                    printf("OK\r\n");
                	firmware_update_control_block_tmp->image_flag = LIFECYCLE_STATE_VALID;
                }
                else
                {
                    printf("NG\r\n");
                	firmware_update_control_block_tmp->image_flag = LIFECYCLE_STATE_INVALID;
                }
                flash_error_code = R_FLASH_Erase((flash_block_address_t)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS, 1);
                if (FLASH_SUCCESS == flash_error_code)
                {
                    printf("OK\r\n");
                }
                else
                {
                    printf("R_FLASH_Erase() returns error. %d.\r\n", flash_error_code);
                    printf("system error.\r\n");
                    while(1);
                }
                flash_error_code = R_FLASH_Write((uint32_t)firmware_update_control_block_tmp, (uint32_t)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS, FLASH_CF_MEDIUM_BLOCK_SIZE);
                if (FLASH_SUCCESS == flash_error_code)
                {
                    printf("OK\r\n");
                }
                else
                {
                    printf("R_FLASH_Write() returns error. %d.\r\n", flash_error_code);
                    printf("system error.\r\n");
                    while(1);
                }
                printf("swap bank...\r\n");
                R_BSP_SoftwareDelay(3000, BSP_DELAY_MILLISECS);
                bank_swap_with_software_reset();
                while(1);
        	}
			break;
        case LIFECYCLE_STATE_TESTING:
            printf("illegal status\r\n");
            printf("swap bank...");
            R_BSP_SoftwareDelay(3000, BSP_DELAY_MILLISECS);
            bank_swap_with_software_reset();
            while(1);
            break;
        case LIFECYCLE_STATE_VALID:
            printf("code flash hash check...");
            R_Sha1((uint8_t*)BOOT_LOADER_UPDATE_EXECUTE_AREA_LOW_ADDRESS + BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH,
            		hash_sha1, (FLASH_CF_MEDIUM_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER) - BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH);
            if(!memcmp(firmware_update_control_block_bank0->signature, hash_sha1, sizeof(hash_sha1)))
            {
                printf("OK\r\n");
            	if(firmware_update_control_block_bank1->image_flag != LIFECYCLE_STATE_BLANK)
            	{
                    printf("erase install area (code flash): ");
                    flash_error_code = R_FLASH_Erase((flash_block_address_t)BOOT_LOADER_UPDATE_TEMPORARY_AREA_HIGH_ADDRESS, FLASH_NUM_BLOCKS_CF - BOOT_LOADER_MIRROR_BLOCK_NUM_FOR_SMALL - BOOT_LOADER_MIRROR_BLOCK_NUM_FOR_MEDIUM);
                    if (FLASH_SUCCESS == flash_error_code)
                    {
                        printf("OK\r\n");
                    }
                    else
                    {
                        printf("R_FLASH_Erase() returns error. %d.\r\n", flash_error_code);
                        printf("system error.\r\n");
                        while(1);
                    }
            	}
                printf("jump to user program\r\n");
                R_BSP_SoftwareDelay(1000, BSP_DELAY_MILLISECS);
                secure_boot_error_code = BOOT_LOADER_SUCCESS;
            }
            else
            {
				printf("NG.\r\n");
				printf("Code flash is completely broken.\r\n");
				printf("Please erase all code flash.\r\n");
				printf("And, write secure boot using debugger.\r\n");
				secure_boot_error_code = BOOT_LOADER_FAIL;
            }
            break;
        default:
            printf("illegal flash rom status code 0x%x.\r\n", firmware_update_control_block_bank0->image_flag);
            R_BSP_SoftwareDelay(1000, BSP_DELAY_MILLISECS);
            software_reset();
            while(1);
    }
    return secure_boot_error_code;
}

static void software_reset(void)
{
	/* stop all interrupt completely */
    set_psw(0);
    R_BSP_InterruptsDisable();
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
    SYSTEM.SWRR = 0xa501;
    while(1);   /* software reset */
}

static void bank_swap_with_software_reset(void)
{
	/* stop all interrupt completely */
    set_psw(0);
    R_BSP_InterruptsDisable();
    R_FLASH_Control(FLASH_CMD_BANK_TOGGLE, NULL);
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
    SYSTEM.SWRR = 0xa501;
    while(1);   /* software reset */
}


/***********************************************************************************************************************
* Function Name: firm_block_read
* Description  :
* Arguments    :
* Return Value :
***********************************************************************************************************************/
static int32_t firm_block_read(uint32_t *firmware, uint32_t offset)
{
    FRESULT ret = TFAT_FR_OK;
    uint16_t size = 0;
    FIL file = {0};
    uint32_t current_buf_position = 0;
    uint32_t current_file_position = offset;

    ret = R_tfat_f_open(&file, INITIAL_FIRMWARE_FILE_NAME, TFAT_FA_READ | TFAT_FA_OPEN_EXISTING);
    if (TFAT_RES_OK == ret)
    {
        R_tfat_f_lseek(&file, current_file_position);
        if (TFAT_RES_OK == ret)
        {
            while(1)
            {
                ret = R_tfat_f_read(&file, &firmware[current_buf_position], FLASH_CF_MEDIUM_BLOCK_SIZE, &size);
                if (TFAT_RES_OK == ret)
                {
                    if (0 == size)
                    {
                        break;
                    }
                    else
                    {
                        current_file_position += size;
                        current_buf_position += size;
                        if((current_buf_position) == FLASH_CF_MEDIUM_BLOCK_SIZE)
                        {
                            current_file_position = 0;
                            break;
                        }
                    }
                }
                else
                {
                    goto firm_block_read_error;
                    break;
                }
            }
        }
        else
        {
            goto firm_block_read_error;
        }
        if (TFAT_RES_OK == ret)
        {
            ret = R_tfat_f_close(&file);
            if (TFAT_RES_OK != ret)
            {
                goto firm_block_read_error;
            }
        }
    }
    else
    {
firm_block_read_error:
        return -1;
    }
    return 0;
}

